Desktop/portfolio/app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" ORDER BY "profiles"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @profile = Profile.first

INSERT INTO "profiles" ("name", "email", "github", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Bruna"], ["email", "bruna@gmail"], ["github", "souzabruna"], ["bio", "gggg"], ["created_at", 2016-09-14 17:55:13 UTC], ["updated_at", 2016-09-14 17:55:13 UTC]]
---
  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save

UPDATE "profiles" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["avatar_file_name", "images.jpg"], ["avatar_file_size", 6232], ["avatar_updated_at", 2016-09-16 14:22:48 UTC], ["updated_at", 2016-09-16 14:22:48 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @profile.update(profile_params)